clamp_ext/clamp_82/clamp_82_01/system/setFieldsDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  9
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    location    "system";
    object      setFieldsDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

// por

defaultFieldValues
(
    volScalarFieldValue por 1
    volScalarFieldValue clampDummy 0
);

regions
(
    zoneToCell
    {
        name  clamp_zone;
        fieldValues
        (
            volScalarFieldValue por 0.45 // IF THIS IS CHANGED, CHANGE invPor IN TRANSPORTPROPERTIES
            volScalarFieldValue clampDummy 1
        );
    }
);

// clampDummy

//defaultFieldValues
//(
//    volScalarFieldValue clampDummy 0
//);
//
//region
//(
//    setToCellZone
//    {
//        set   clamp_zone;
//        fieldValues
//        (
//            volScalarFieldValue clampDummy 1
//        );
//    }
//);



// ************************************************************************* //
